<?php

namespace Modules\Course\Database\Seeders;

use App\Models\Course;
use Illuminate\Database\Seeder;
use Illuminate\Database\Eloquent\Model;

class CoursesSeederTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Course::create([
            'name' => 'مدخل الى علوم القرآن',
            'instructor_name' => 'إسلام أحمد',
            'instructor_avatar' => 'default-avatar.png',
            'sub_title' => 'شرح لكتاب المدخل إلى علوم القرآن الكريم لمحمد فاروق النبهان',
            'is_catalog' => '1',
            'level_id' => '1',
            'course_category_id' => '1',
            'course_logo' => '6e5a04cd5fc5ac4eb953878a23520034.jpg',
            'about_course' => "<p>دورة لشرح لكتاب المدخل إلى علوم القرآن الكريم لمحمد فاروق النبهان  </p><p>علوم القرآن هي العلوم المتعلقة بالقرآن من حيث نزوله وترتيبه، وجمعه وكتابته، وقراءاته وتجويده، وعلوم التفسير ومعرفة المحكم والمتشابه، والناسخ والمنسوخ، وأسباب النزول، وإعجازه، وإعرابه ورسمه، وعلم غريب القرآن، وغير ذلك من العلوم المتعلقة بالقرآن. ويُعرف أيضًا بأنها جميع العلوم والبحوث التي تتعلق بالقرآن، أو كل ما يتصل بالقرآن.يُطلق عليها أيضًا علوم التنزيل، أو علوم الكتاب، وقد عدّ الزركشي علوم القرآن في كتابه البرهان في علوم القرآن 47 علمًا، وأوصلها جلال الدين السيوطي في كتابه الإتقان في علوم القرآن لـ 80 علمًا.</p><p>علوم القرآن: هو لفظ مركب إضافي، وله جزءان، مضاف وهو «علوم»، ومضاف إليه وهو «قرآن». ويُعرف بأنه جميع العلوم والبحوث التي تتعلق بالقرآن، أو كل ما يتصل بالقرآن. ومن تعريفاته عند المعاصرين بأنه: «مباحث تتعلق بالقرآن الكريم من ناحية نزوله وترتيبه وجمعه وكتابته وقراءته وتفسيره وإعجازه وناسخه ومنسوخه ومكيه ومدنيه ودفع الشبه عنه ونحو ذلك». يقول محمد عبد العظيم الزرقاني: «موضوعه هو مجموع موضوعات تلك العلوم المنضوية تحت لوائه. وموضوع كل واحد منها هو القرآن الكريم من ناحية واحدة من تلك النواحي. فعلم القراءات مثلا موضوعه القرآن الكريم من ناحية لفظه وأدائه وعلم التفسير موضوعه القرآن الكريم من ناحية شرحه ومعناه».</p>",
            'highlights_1' => 'تعلم تعريف علوم القرآن',
            'highlights_2' => 'تدوين علوم القرآن',
            'highlights_3' => 'التأليف في مباحث علوم القرآن',
            'highlights_4' => 'مباحث علوم القرآن',
            'highlights_5' => '',
            'promotional_video' => 'https://www.youtube.com/watch?v=16vdgn4MIPs',
            'price' => '0',
            'is_publish' => '1',
        ]);

        Course::create([
            'name' => 'تفسير جزء عم',
            'instructor_name' => 'علي إسماعيل',
            'instructor_avatar' => 'default-avatar.png',
            'sub_title' => 'شرح لكتاب المدخل إلى علوم القرآن الكريم لمحمد فاروق النبهان',
            'is_catalog' => '1',
            'level_id' => '1',
            'course_category_id' => '1',
            'course_logo' => 'cover.jpg',
            'about_course' => "<p>هذا تفسير سهلُ العبارة، واضحُ الفكرة، مختصرٌ، مقدّمٌ لعموم المسلمين، معدٌّ بالأصالةِ لمن بَعدت عليه مراجع التّفسير، أو صعبت عليه أساليبها، وقد اختار كاتبُه من الألفاظ ما كان مألوفا، ومن الأفكار ما كان معروفا، ولم يأت فيه بجديد من عنده، وإنّما هي معانٍ مأثورةٌ عن المفسّرين الموثوقين؛ أعاد صياغتها وترتيبها.</p>",
            'highlights_1' => 'تفسير جزء عم',
            'highlights_2' => 'معرفة أسباب النزول',
            'highlights_3' => 'معرفة السور من حيث مكية ام مدنية',
            'promotional_video' => 'https://www.youtube.com/watch?v=LrOKIVun_kg',
            'is_publish' => '1',
            'price' => '0'

        ]);

        Course::create([
            'name' => 'مقدمة في علوم الحديث',
            'instructor_name' => 'أشرف أحمد',
            'instructor_avatar' => 'default-avatar.png',
            'sub_title' => 'شرح كتاب مقدمات في علوم الحديث لإسلام محمود درباله',
            'is_catalog' => '1',
            'level_id' => '1',
            'course_category_id' => '2',
            'course_logo' => '29506-moqadimat-ibn-al-salah.jpg',
            'about_course' => "<p>كتاب متخصص في علوم الحديث يشتمل على أقسام الحديث وأنواعه من حيث الصحةوالضعف والرفع والوقف مع رسوم شجرية لأنواع علوم الحديث.</p>",
            'highlights_1' => 'مقدمة في علوم الحديث',
            'highlights_2' => 'أقسام الحديث وأنواعه من حيث الصحةوالضعف',
            'highlights_3' => 'منهج علم الحديث',
            'highlights_4' => 'نشأة علم الحديث',
            'highlights_5' => 'قائمة علماء الحديث',
            'promotional_video' => 'https://www.youtube.com/watch?v=WTOW_LFQWWs',
            'is_publish' => '1',
            'price' => '0'
        ]);
    }
}
